## Homework 3 : Databases

#### Due Date: Thursday June 18, 2020 at 11:59PM EST

We want to get practice with querying databases. We will study a dataset about donations throughout the United States presidential election in 2016. The data comes from the [Federal Election
Commission](https://www.fec.gov/data/).  

The questions guide you step-by-step through these steps of data processing. Please post to CampusWire with any questions. 

#### Collaboration Policy

Data science is a collaborative activity. While you may discuss the homework with classmates, you should answer the questions by yourself. If you discuss the assignments with other students, the please **include their names** below.

**Name:** *list name here*

**NetId:** *list netid here*

**Collaborators:** *list names here*

### Rubric

Question | Points
--- | ---
Question 1.1 | 1
Question 1.2 | 1
Question 1.3 | 1
Question 2.1 | 1
Question 2.2 | 1
Question 2.3 | 1
Question 2.4 | 2
Question 3.1 | 1
Question 3.2 | 2
Total | 11

In [1]:
# importing packages 

import pandas as pd
import numpy as np
import os, sys

import matplotlib
import matplotlib.pyplot as plt

import sqlalchemy

# changing some settings

pd.set_option('display.max_rows', 10)
pd.set_option('display.max_columns', 8)

%matplotlib inline
plt.rcParams['figure.figsize'] = (9,7)

In [2]:
# test import of packages 

assert "pandas" in sys.modules and "pd" in locals()
assert "matplotlib" in sys.modules and "plt" in locals()
assert "sqlalchemy" in sys.modules

### Loading the Data

We have three tables in the SQLite database.

In [3]:
home = os.environ['HOME']
data_path = f"{home}/shared/fec_nyc.sqlite" 

engine = sqlalchemy.create_engine(f"sqlite:///{data_path}")

The table `cand` contains names and party affiliations of candidates in the election.

In [4]:
pd.read_sql("select * from cand limit 5;", con = engine)

,cand_id,cand_name,cand_pty_affiliation,cand_election_yr,...,cand_st2,cand_city,cand_st,cand_zip
0,H0AK00097,"COX, JOHN R.",REP,2014,...,,ANCHOR POINT,AK,99556
1,H0AL02087,"ROBY, MARTHA",REP,2016,...,,MONTGOMERY,AL,36101
2,H0AL02095,"JOHN, ROBERT E JR",IND,2016,...,,MILLBROOK,AL,36054
3,H0AL05049,"CRAMER, ROBERT E ""BUD"" JR",DEM,2008,...,,HUNTSVILLE,AL,35804
4,H0AL05163,"BROOKS, MO",REP,2016,...,,HUNTSVILLE,AL,35802

The table `comm` contains names and types of fundraising committees.

In [5]:
pd.read_sql("select * from comm limit 5;", con = engine)

,cmte_id,cmte_nm,tres_nm,cmte_st1,...,cmte_filing_freq,org_tp,connected_org_nm,cand_id
0,C00000059,HALLMARK CARDS PAC,ERIN BROWER,2501 MCGEE,...,M,C,,
1,C00000422,AMERICAN MEDICAL ASSOCIATION POLITICAL ACTION ...,"WALKER, KEVIN","25 MASSACHUSETTS AVE, NW",...,M,M,AMERICAN MEDICAL ASSOCIATION,
2,C00000489,D R I V E POLITICAL FUND CHAPTER 886,TOM RITTER,3528 W RENO,...,Q,L,TEAMSTERS LOCAL UNION 886,
3,C00000547,KANSAS MEDICAL SOCIETY POLITICAL ACTION COMMITTEE,"C. RICHARD BONEBRAKE, M.D.",623 SW 10TH AVE,...,Q,T,,
4,C00000638,INDIANA STATE MEDICAL ASSOCIATION POLITICAL AC...,"VIDYA KORA, M.D.","322 CANAL WALK, CANAL LEVEL",...,Q,M,,

The table `indiv_sample_nyc` contains donations from individual who reside in New York City

In [6]:
pd.read_sql("select * from indiv_sample_nyc limit 5;", con = engine)

,cmte_id,amndt_ind,rpt_tp,transaction_pgi,...,file_num,memo_cd,memo_text,sub_id
0,C00445015,N,Q1,P,...,1002485,,,4041420151241812398
1,C00510461,N,Q1,P,...,1002590,,* EARMARKED CONTRIBUTION: SEE BELOW,4041420151241813640
2,C00422410,N,Q1,P,...,1003643,,,4041620151241914560
3,C00510461,N,Q1,P,...,1002590,,* EARMARKED CONTRIBUTION: SEE BELOW,4041420151241813630
4,C00510461,N,Q1,P,...,1002590,,* EARMARKED CONTRIBUTION: SEE BELOW,4041420151241813632

### Question 1: Selecting Records

We want to select records from the three tables. Each query will require the records to satisfy some conditions.

#### Question 1.1

Note that `cand_id` is the primary key in the table `cand`. So the entries in the column `cand_id` are distinct. 

Complete the `SELECT` command to determine the number of records in the `cand_id` column with `cand_pty_affiliation` equal to `DEM`.

In [7]:
query1_1 = '''
SELECT ... 
FROM cand
WHERE cand_pty_affiliation = 'DEM'
'''

### BEGIN SOLUTION 
query1_1 = '''
SELECT COUNT(cand_id)
FROM cand
WHERE cand_pty_affiliation = 'DEM'
'''
### END SOLUTION

pd.read_sql(query1_1, engine)

   COUNT(cand_id)
0            2261

<font color='red' size="4">The COUNT() function returns the number of records returned by a select query.

Note: NULL values are not counted.</font>

How many candidates were Democrats?

In [8]:
q1_1 = ... 

### BEGIN SOLUTION 
q1_1 = 2261
### END SOLUTION

In [9]:
# TEST 

assert 2000 < q1_1 < 3000

### BEGIN HIDDEN TESTS
assert q1_1 == 2261
### END HIDDEN TESTS

#### Question 1.2

We want to determine the number of donors with a contribution exceeding \$5,000,000. Note that the `transaction_amt` column of the table `indiv_sample_nyc` contains the contribution in dollars.

Complete the `WHERE` command to limit the values of `transaction_amt`.

In [10]:
query1_2 = """
SELECT COUNT(*) as Large_Donations
FROM indiv_sample_nyc
WHERE ...
"""

### BEGIN SOLUTION
query1_2 = '''
SELECT count(*) as Large_Donations
FROM indiv_sample_nyc
WHERE transaction_amt > 5000000
'''
### END SOLUTION

pd.read_sql(query1_2, engine)

   Large_Donations
0                6

How many donors had a contribution exceeding \$5,000,000?

In [11]:
q1_2 = ... 

### BEGIN SOLUTION 
q1_2 = 6
### END SOLUTION

In [12]:
# TEST 

assert 0 < q1_2 < 100

### BEGIN HIDDEN TESTS
assert q1_2 == 6
### END HIDDEN TESTS

#### Question 1.3

We can use the keyword `LIKE` in the `WHERE` command to filter by a pattern of characters. For example, if we had the command 

> WHERE cmte_nm LIKE '%%HILARY%%'

in a query to the `comm` table, then the committee name of each record contains the word `HILARY`. Note that `%%` is a wildcard character.

Complete the `WHERE` command so that each record contains the word `BERNIE`.

In [13]:
query1_3 = """ 
SELECT cmte_nm AS Committee_Name
FROM comm
WHERE cmte_nm LIKE '%%BERNIE%%';
"""

### BEGIN SOLUTION
query1_3 = """ 
SELECT cmte_nm AS Committee_Name
FROM comm
WHERE cmte_nm LIKE '%%BERNIE%%';
"""
### END SOLUTION

pd.read_sql(query1_3,engine)

                          Committee_Name
0              FRIENDS OF BERNIE SANDERS
1                   BERNIER FOR CONGRESS
2             BERNIE REEVES FOR CONGRESS
3                            BERNIE 2016
4   NORTHERN MICHIGAN FOR BERNIE SANDERS
..                                   ...
18            BUFFALO FOR BERNIE SANDERS
19         IDAHO PROGRESSIVE BERNIECRATS
20                  BLACK MEN FOR BERNIE
21       PITTSBURGH DELEGATES FOR BERNIE
22             BERNIECRATS OF CALIFORNIA

[23 rows x 1 columns]

<font color='red' size="4">A wildcard character is used to substitute one or more characters in a string.

Wildcard characters are used with the SQL LIKE operator. The LIKE operator is used in a WHERE clause to search for a specified pattern in a column.
 
'%' represents zero or more characters. For example, bl% finds bl, black, blue, and blob.</font>

How many records have a committee name containing the word `BERNIE`?

In [14]:
q1_3 = ... 

### BEGIN SOLUTION 
q1_3 = 23
### END SOLUTION

In [15]:
# TEST 

assert 0 < q1_3 < 50

### BEGIN HIDDEN TESTS
assert q1_3 == 23
### END HIDDEN TESTS

### Question 2: Aggregating Records

We want to explore the donations across different occupations.

#### Question 2.1

Complete the `SELECT` command with the keyword `DISTINCT` to determine the number of unique entries in the `occupation` column.

In [16]:
query2_1 = '''
SELECT COUNT(...)
FROM indiv_sample_nyc 
'''
### BEGIN SOLUTION
query2_1 = '''
SELECT COUNT(DISTINCT occupation)
FROM indiv_sample_nyc
'''
### END SOLUTION

pd.read_sql(query2_1,engine)

   COUNT(DISTINCT occupation)
0                       14089

How many distinct occupations?

In [17]:
q2_1 = ... 

### BEGIN SOLUTION 
q2_1 = 14089
### END SOLUTION

In [18]:
# TEST 

assert 10000 < q2_1 < 20000

### BEGIN HIDDEN TESTS
assert q2_1 == 14089
### END HIDDEN TESTS

#### Question 2.2

We can count the number of donors for each occupation.

In [19]:
query2_2 = '''
SELECT 
    occupation AS occupation, 
    count(*) AS count
FROM indiv_sample_nyc
GROUP BY occupation 
ORDER BY count DESC
LIMIT 10
'''

pd.read_sql(query2_2, engine)

          occupation  count
0       NOT EMPLOYED  56006
1            RETIRED  48481
2           ATTORNEY  29537
3                     21212
4  MANAGING DIRECTOR  12540
5             WRITER   9445
6          PHYSICIAN   9430
7          PROFESSOR   9309
8             LAWYER   9048
9          EXECUTIVE   8376

Modify the query to compute another column called `average_amount`. The column should contain the average value of the donations in `transaction_amt`.

In [20]:
query2_2 = '''
SELECT 
    occupation AS occupation, 
    count(*) AS count,
    ...
FROM indiv_sample_nyc
GROUP BY occupation 
ORDER BY count DESC
LIMIT 10
'''

### BEGIN SOLUTION
query2_2 = '''
SELECT 
    occupation AS occupation, 
    count(*) AS count,
    avg(transaction_amt) as average_amount
FROM indiv_sample_nyc
GROUP BY occupation 
ORDER BY count DESC
LIMIT 10
'''
### END SOLUTION

pd.read_sql(query2_2, engine)

          occupation  count  average_amount
0       NOT EMPLOYED  56006      143.546602
1            RETIRED  48481      448.048266
2           ATTORNEY  29537      597.655551
3                     21212     4350.852772
4  MANAGING DIRECTOR  12540      383.655104
5             WRITER   9445      366.103017
6          PHYSICIAN   9430      217.805832
7          PROFESSOR   9309      179.527876
8             LAWYER   9048      558.407493
9          EXECUTIVE   8376     3991.275072

<font color='red' size="4">The GROUP BY statement groups rows that have the same values into summary rows, like "find the count and average_amount in each occupation".

The GROUP BY statement is often used with aggregate functions (COUNT, MAX, MIN, SUM, AVG) to group the result-set by one or more columns.</font>

What is the average amount of donations among lawyers?

In [21]:
q2_2 = ... 

### BEGIN SOLUTION 
q2_2 = 558
### END SOLUTION

In [22]:
# TEST 

assert 0 < q2_2 < 1000

### BEGIN HIDDEN TESTS
assert np.abs(q2_2 - 558) < 1
### END HIDDEN TESTS

#### Question 2.3

Note that some of the occupations have few donors.

In [23]:
query2_3 = '''
SELECT 
    occupation AS occupation, 
    count(*) AS count
FROM indiv_sample_nyc
GROUP BY occupation 
ORDER BY count ASC
LIMIT 10
'''

pd.read_sql(query2_3, engine)

                        occupation  count
0                     & PROFFESSOR      1
1                           109059      1
2               1ST VP DEVELOPMENT      1
3               2ND VICE PRESIDENT      1
4                       4C ADVISOR      1
5                            68644      1
6                   9-11 RESPONDER      1
7                              AAG      1
8                              ABC      1
9  ABSOLUTE ELECTRICAL CONTRACTING      1

Modify the query from Question 2.2:

- Add the `HAVING` command to remove any group with `count` less than or equal to 10.
- Change the `ORDER BY` command to sort in descending order by the value in the `average_amount` column.

In [23]:
query2_3 = '''
SELECT 
    occupation AS occupation, 
    count(*) AS count,
    ...
FROM indiv_sample_nyc
GROUP BY occupation 
HAVING count ...
ORDER BY ...
LIMIT 10
'''

### BEGIN SOLUTION
query2_3 = '''
SELECT 
    occupation AS occupation, 
    count(*) AS count,
    avg(transaction_amt) as average_amount
FROM indiv_sample_nyc
GROUP BY occupation
HAVING count > 10
ORDER BY average_amount DESC
LIMIT 10
'''
### END SOLUTION

pd.read_sql(query2_3, engine)

                 occupation  count  average_amount
0                    C.E.O.     53   185271.886792
1       BIOMEDICAL RESEARCH     40   110563.750000
2             PRESIDENT/CEO    205    92551.541463
3             FOUNDER & CEO     91    68304.626374
4            PHILANTHROPIST    257    51764.404669
5     FOUNDER AND PRINCIPAL     11    43490.909091
6             CEO & FOUNDER     15    37795.266667
7           GROUP PRESIDENT     19    29775.000000
8              FUND MANAGER     67    29151.119403
9  CHIEF INVESTMENT OFFICER     42    26616.666667

What is the average amout of a donation for the occupation `C.E.O.`?

In [25]:
q2_3 = ... 

### BEGIN SOLUTION 
q2_3 = 185271
### END SOLUTION

In [26]:
# TEST 

assert 100000 < q2_3 < 200000

### BEGIN HIDDEN TESTS
assert np.abs(q2_3 - 185271) < 1
### END HIDDEN TESTS

#### Questions 2.4

We can change the granularity of the groups by grouping records on occupation and name. 

Complete the `GROUP BY` command in the query to group by `occupation`, `name`.

In [24]:
query2_4 = '''
SELECT 
    occupation AS occupation,
    name AS name,
    sum(transaction_amt) AS total_amount
FROM indiv_sample_nyc
GROUP BY ...
ORDER BY total_amount DESC
LIMIT 10'''

### BEGIN SOLUTION
query2_4 = '''
SELECT 
    occupation AS occupation,
    name AS name,
    sum(transaction_amt) AS total_amount
FROM indiv_sample_nyc
GROUP BY occupation,name
ORDER BY total_amount DESC
LIMIT 10
'''
### END SOLUTION

pd.read_sql(query2_4, engine)

       occupation                   name  total_amount
0                   HILLARY VICTORY FUND      35379700
1       EXECUTIVE  BLOOMBERG, MICHAEL R.      21665124
2   PRESIDENT/CEO       TRUMP, DONALD J.      18633157
3        CHAIRMAN          SOROS, GEORGE      17281093
4  PHILANTHROPIST          SIMONS, JAMES      11032000
5       PRESIDENT       SIMONS, JAMES H.      10525000
6                    C.V. STARR & CO INC      10000000
7          C.E.O.    SINGER, PAUL ELLIOT       5000000
8                    HILLARY ACTION FUND       4950000
9          C.E.O.           SINGER, PAUL       4500000

__Multiple Choice:__ Which individual contributed the most donations? 

1. Soros
1. Trump
1. Simons 
1. Bloomberg

In [28]:
q2_4 = ... 

### BEGIN SOLUTION 
q2_4 = "Bloomberg"
### END SOLUTION

In [29]:
# TEST 

assert q2_4 in ["Soros", "Trump", "Simons", "Bloomberg"]

### BEGIN HIDDEN TESTS
assert q2_4 == "Bloomberg"
### END HIDDEN TESTS

We calculated the average amount of a donation for each occupation in Question 2.3. Here we computed the average over the donations. We did not compute the average over donations grouped by names. Since some donors make multiple donations, we might obtain larger average grouping by name.

In [25]:
query2_4_2 = '''
SELECT occupation, avg(total_amount) AS amount, count(*) AS count
FROM (
    SELECT name, occupation, sum(transaction_amt) AS total_amount
    FROM indiv_sample_nyc 
    GROUP BY occupation, name
) AS total_contributions
GROUP BY occupation
ORDER BY amount DESC
LIMIT 10
'''

pd.read_sql(query2_4_2, engine)

                        occupation        amount  count
0           CHAIRMAN CEO & FOUNDER  1.023333e+06      3
1            BIOMEDICAL RESEARCHER  1.000000e+06      1
2              BIOMEDICAL RESEARCH  7.370917e+05      6
3                    PRESIDENT/CEO  6.776095e+05     28
4             OWNER, CHAIRMAN, CEO  6.000000e+05      1
5  FOUNDING AND MANAGING PRINCIPAL  4.500000e+05      2
6      CHAIRMAN & SENIOR EXECUTIVE  4.267480e+05      1
7           DIRECTOR OF CURRICULUM  4.227330e+05      1
8    CHAIRMAN AND SENIOR EXECUTIVE  4.000000e+05      1
9                           C.E.O.  3.927764e+05     25

<font color='red' size="4">A Subquery or Inner query or a Nested query is a query within another SQL query and embedded within the WHERE clause.

A subquery is used to return data that will be used in the main query as a condition to further restrict the data to be retrieved.

Subqueries can be used with the SELECT, INSERT, UPDATE, and DELETE statements along with the operators like =, <, >, >=, <=, IN, BETWEEN, etc.

There are a few rules that subqueries must follow âˆ’

Subqueries must be enclosed within parentheses.

A subquery can have only one column in the SELECT clause, unless multiple columns are in the main query for the subquery to compare its selected columns.

An ORDER BY command cannot be used in a subquery, although the main query can use an ORDER BY. The GROUP BY command can be used to perform the same function as the ORDER BY in a subquery.

Subqueries that return more than one row can only be used with multiple value operators such as the IN operator.

The SELECT list cannot include any references to values that evaluate to a BLOB, ARRAY, CLOB, or NCLOB.

A subquery cannot be immediately enclosed in a set function.

The BETWEEN operator cannot be used with a subquery. However, the BETWEEN operator can be used within the subquery.</font>

Note that the above query has two steps:

- Step 1: We group the records by `occupation` and `name` to compute the sum of the donations in `transaction_amt`
- Step 2: We group the records from Step 1 by `occupation` to compute the average of `total_amount`.

Note that the amount for the occupation `C.E.O.` is \$392776. 

__True or False:__ Is \$392776 larger than the amount from Question 2.3?

In [26]:
q2_4_2 = ... 

### BEGIN SOLUTION 
q2_4_2 = True
### END SOLUTION

In [27]:
# TEST 

assert q2_4_2 in [True, False]

### BEGIN HIDDEN TESTS
assert q2_4_2 == True
### END HIDDEN TESTS

### Question 3: Linking Records 

The campaign of Bernie Sanders received small contributions from many donors. We can nickname these contributors as small-donors. An  
[article](http://www.politifact.com/nbc/statements/2016/mar/21/hillary-clinton/hillary-clinton-says-her-campaign-depends-small-do/) argued that the campaign of Hillary Clinton lacked small-donors. We can check the difference in small-donors amongst residents of New York City. 

The contributions of donors in `indiv_sample_nyc` are linked to committees in `comm` through `cmte_id`.
The many committee in support of the Hillary Clinton campaign was 
`HILLARY FOR AMERICA`. The many committee in support of the Bernie Sanders campaign was `BERNIE 2016`.


#### Questions 3.1

Complete the query to calculate the total amount of donations to these committees

1. Complete the `WHERE` command. The query takes the cross join of `indiv_sample_nyc` and `comm`. So we need to require that `indiv_sample_nyc.cmte_id` equals `comm.cmte_id`.
1. Complete the `HAVING` command. Indicate `HILLARY FOR AMERICA` or `BERNIE 2016` for `comm.cmte_nm`.

In [28]:
query3_1 = '''
SELECT 
    comm.cmte_nm AS cmte_nm, 
    sum(indiv_sample_nyc.transaction_amt) AS total_transaction_amt
FROM indiv_sample_nyc, comm 
WHERE ...
GROUP BY comm.cmte_nm
HAVING
    cmte_nm = ... OR
    cmte_nm = ...
'''

### BEGIN SOLUTION
query3_1 = '''
SELECT 
    comm.cmte_nm AS cmte_nm, 
    sum(indiv_sample_nyc.transaction_amt) AS total_transaction_amt
FROM indiv_sample_nyc, comm 
WHERE indiv_sample_nyc.cmte_id = comm.cmte_id
GROUP BY comm.cmte_nm
HAVING
    cmte_nm = 'HILLARY FOR AMERICA' OR
    cmte_nm = 'BERNIE 2016' 
'''
### END SOLUTION

pd.read_sql(query3_1, engine)

               cmte_nm  total_transaction_amt
0          BERNIE 2016                2361892
1  HILLARY FOR AMERICA               25099091

How much did contributors give to `BERNIE 2016`?

In [29]:
q3_1 = ... 

### BEGIN SOLUTION 
q3_1 = 2361892
### END SOLUTION

In [30]:
# TEST 

assert 2000000 < q3_1 < 3000000

### BEGIN HIDDEN TESTS
assert q3_1 == 2361892
### END HIDDEN TESTS

#### Question 3.2

We can think of small-donors as contributors giving less than \$200. We can calculate the funding for the committee `HILARY FOR AMERICA` owing to small-donors.

In [31]:
query3_2_1 = """
SELECT SUM(transaction_amt)  
FROM indiv_sample_nyc, comm
WHERE indiv_sample_nyc.cmte_id = comm.cmte_id
    AND comm.cmte_nm = 'HILLARY FOR AMERICA'
    AND transaction_amt < 200
"""

pd.read_sql(query3_2_1, engine)

   SUM(transaction_amt)
0               3539367

We learned from Question 3.1 that `HILARY FOR AMERICA` received \$25099091 from all donors. So 14\% of donors for Hilary Clinton are small-donors.

In [37]:
3539367 / 25099091

0.14101574435504458

Calculate the funding for the committee `BERNIE 2016` owing to small-donors.

In [38]:
query3_2_2 = ...

### BEGIN SOLUTION 
query3_2_2 = """
SELECT SUM(transaction_amt)  
FROM indiv_sample_nyc, comm
WHERE indiv_sample_nyc.cmte_id = comm.cmte_id
    AND comm.cmte_nm = 'BERNIE 2016'
    AND transaction_amt < 200
"""
### END SOLUTION

pd.read_sql(query3_2_2, engine)

   SUM(transaction_amt)
0               1014885

Calculate the percentage of contributions from small donors for Bernie Sanders.

In [39]:
q3_2 = ...

### BEGIN SOLUTION 
q3_2 = 1014885/2361892
### END SOLUTION

In [40]:
# TEST 

assert 0 < q3_2 < 1

### BEGIN HIDDEN TESTS
assert 0.4 < q3_2 < 0.5
### END HIDDEN TESTS

__True or False:__ The percentage of contributions from small for Bernie Sanders is greater than 14\%.

In [41]:
q3_2_2 = ... 

### BEGIN SOLUTION 
q3_2_2 = True
### END SOLUTION

In [42]:
# TEST 

assert q3_2_2 in [True, False]

### BEGIN HIDDEN TESTS
assert q3_2_2 == True
### END HIDDEN TESTS